export const Steps = [
    {
      id: 1,
      step_name: "שלב 1 – קליטה (Foi Recebido)",
      steps_list: [
        "1. קבלת הבקשה והמסמכים המצורפים שלה על ידי הקונסרבטוריון.",
        "2. הנהלת החשבונות של הקונסרבטוריון מוודאת שאגרת הבקשה (250 €) שולמה.",
        "3. הקצאת מספר תיק לבקשה וקוד מעקב.",
      ],
      step_progress_bar_name: 'הבקשה התקבלה'
    },
    {
      id: 2,
      step_name: "שלב 2 – רישום (Foi Registado):",
      steps_list: [
        "4. סריקת מסמכים.",
        "5. הקצאת התיק לטיפול (עשוי להישאר ב-קונסרבטוריון CRC של ליסבון/פורטו עצמם או שיופץ לקונסרבטוריונים אחרים להמשך טיפול, החל מאפריל 2019).",
      ],
      step_progress_bar_name: 'רישום הבקשה'
    },
    {
      id: 3,
      step_name: "שלב 3 – התייעצויות (Aguarda Consultas):",
      steps_list: [
        "6. בדיקת רקע פלילי - התייעצות עם גורמים חיצוניים: PJ  - המשטרה השיפוטית , SEF - משטרת הגבולות וההגירה, - DGAJ  מינהלת משרד המשפטים,  INTERPOL – הארגון הבינלאומי לשיטור פלילי, שגרירויות פורטוגל בעולם וגורמים בינלאומיים נוספים.        ",
      ],
      step_progress_bar_name: 'עיבוד הבקשה'
    },
    {
      id: 4,
      step_name: "שלב 4 – אימות מסמכים (Verificação Documentos):",
      steps_list: [
        "7. ניתוח מוקדם ובדיקה של המסמכים על ידי הפקיד הרשמי של הקונסרבטוריון, תוך התכתבויות בסופו של דבר עם המבקש או בא כוחו, כדי לקבל מידע נוסף, תיקון והשלמת חוסרים.        ",
      ],
      step_progress_bar_name: 'אימות מסמכים'
    },
    {
      id: 5,
      step_name: "שלב 5 – אנליזת הבקשה (Análise Pedido):",
      steps_list: [
        "8. אנליזה מעמיקה - סקירת המסמכים, תנאים משפטיים אחרים למתן אזרחות והכנת חוות דעת על ידי פקיד בכיר של הקונסרבטוריון CRC המטפל.",
        "9. שיגור התיק למשרד המשפטים לצורך שיגור/החלטה סופית על מתן אזרחות.",
      ],
      step_progress_bar_name: 'הבקשה באנליזה'
    },
    {
      id: 6,
      step_name: "שלב 6 – שיגור החלטה סופית (Despacho):",
      steps_list: ['10. אישור אזרחות ע"י שרת המשפטים או דחיית הבקשה.'],
      step_progress_bar_name: 'קבלת החלטה'
    },
    {
      id: 7,
      step_name: "שלב 7 – סיום (Terminado):",
      steps_list: [
        "11. סוף תהליך – הנפקת תעודת לידה ורישום אזרחות פורטוגלית במרשם הקונסרבטוריון ותיוק הבקשה שאושרה/נדחתה.",
      ],
      step_progress_bar_name: 'רישום האזרחות'
    },
  ]